[
    {
        "company": "Hubbard Law Firm, P.C.",
        "location": "Urbandale, IA",
        "name": "Aaron Hubbard",
        "testimonial": "I have worked with Linda on countless real estate transactions over the last several years, and would highly recommend her as a transaction coordinator.  Linda is an expert in guiding the sale through the process, providing documentation as needed, and following up on any issue that needs addressed.  As a real estate and settlement Attorney I know when Linda is involved in the process it will be handled in a professional and efficient manner."
    },
    {
        "testimonial": "Linda Ruppert at Assistant Pro, LLC is a pleasure to work with and gets an A++ from me!  She is always on top of her game.  She goes over and above to make sure everything is in place for the closings she is involved in.  She is a pure joy to work with.  There should be no hesitation when it comes to involving this one of a kind gal for help with your real estate transaction!",
        "name": "Jenny VanBoening",
        "company": "Wasker, Dorr, Wimmer & Marcouiller, PC",
        "location": "West Des Moines, IA"
    },
    {
        "testimonial": "We have been using Linda and her team for about a year now. Because they work hard to make sure things are done on time and done right we focus on what we do best. I’m not sure how they get it all done but they definitely sweat the details and I always get great comments from our clients about Linda and her customer focused service. We consider Linda and her team an integral part of our success and I would recommend her services to everyone.",
        "name": "Doug Burnett",
        "company": "Keller Williams - Broker",
        "location": "Clive, IA"
    },
    {
        "testimonial": "Linda was a great addition to our real estate team so that we could leverage our time better to get more business. There are so many details that need taken care of post-acceptance prior to closing, that we wanted to be sure nothing fell through the cracks. Linda and her team are great with the process and details. Linda has actually been in real estate longer than myself, so often, she knows what to do, even if I don't. There are several instances where Linda went above and beyond what I believe a transaction coordinator is responsible for and that is why she is worth every penny.",
        "name": "Rochelle Burnett",
        "company": "Keller Williams - Realtor",
        "location": "Clive, IA"
    }
]
